import lamtouni from "./assets/heros/أبو بكر بن عمر اللمتوني.jpeg";
import alb from "./assets/heros/ألب أرسلان.jpeg";
import taimya from "./assets/heros/ابن تيمية.jpeg";
import qohtoba from "./assets/heros/الحسن بن قحطبة.jpeg";
import bibarss from "./assets/heros/الظاهر بيبرس.jpeg";
import qaaqaa from "./assets/heros/القعقاع بن عمرو التميمي.jpeg";
import elKamil from "./assets/heros/الكامل محمد الأيوبي.jpeg";
import moatassim from "./assets/heros/المعتصم بالله.jpeg";
import barbarouss from "./assets/heros/خير الدين بربروس.jpeg";
import jubair from "./assets/heros/سعيد بن جبير.jpeg";
import salahudin from "./assets/heros/صلاح الدين الايوبي.jpeg";
import tariq from "./assets/heros/طارق بن زياد.jpeg";
import elFatih from "./assets/heros/محمد الفاتح.jpeg";
import thaqafi from "./assets/heros/محمد بن القاسم الثقفي.jpeg";
import sabaktakin from "./assets/heros/محمود بن سبكتكين الغزنوي.jpeg";
import toussi from "./assets/heros/نظام الملك الطوسي.jpeg";
import nourDinZin from "./assets/heros/نور الدين زنكي.jpeg";
import tachfin from "./assets/heros/يوسف بن تاشفين.jpeg";

const heros = [
  {
    id: Math.random().toString(36).substring(2),
    clicked: false,
    name: "أبو بكر بن عمر اللمتوني",
    img: lamtouni,
    description: `أبو بكر بن عمر اللمتوني هو أمير المرابطين ففي القرن الخامس الهجري وبعد وفاة مؤسسة دولة المرابطين المشهور الشيخ عبد الله ياسين، تولى تلميذه أبو بكر اللمتوني الإمارة من بعده وهو ابن عم يوسف ابن تاشافين فقد ولاه على زعامة المغرب في الشمال، ثم توجه أبو بكر جنوبا حيث لم يذهب فاتح مسلم من قبل ليدعوا الناس إلى ترك عبادة الأوثان وعبادة الله الكبير المتعال.
       .فأسلم على يديه خلق كثير ودخل الإسلام الآن ما يساوي 15 دولة إفريقية أو أكثر على يديه حتى لقي ربه شهيدا في إحدى غزواته`,
  },
  {
    id: Math.random().toString(36).substring(2),
    clicked: false,
    name: "ألب أرسلان",
    img: alb,
    description: `في عام 463 هجرية قام الامراطور البيزنطي رومانوس ديودين بجمع جيش ضخم أراد به استعادة أرمينية والمناطق الواقعة في غرب آسيا من المسلمين، فجمع أكثر من مئة ألف مقاتل. جمع ألب أرسلان جيشه وصلى بهم وبكى فبكى الناس لبكائه ودعا ودعوا معه وقال لهم من أراد الانصراف فلينصرف فما ها هنا سلطان يأمر وينهى ثم ألقى القوس والنشاب وأخذ السيف والرمح وعقد ذنب فرسه بيده معلنا أن الأمر إلتحام وليس رماية، ثم انقض الجيش المسلم على أعدائهم وكأنهم الصواعق المرسلة فكانوا وسط جيش الروم وأمدهم الله بمدد من عنده فكان الغبار يعمي أعدائهم ولا يؤثر شيئا في المسلمين فدارت الدائرة على العدو الكافر وماهي إلى ساعة من النهار حتى تحقق النصر وانقشع غبار المعركة عن جثث الروم تملأ ساحة القتال. كانت هذه المعركة "معركة ملاذكرد" من أسباب قيام دولة السلاجقة`,
  },
  {
    id: Math.random().toString(36).substring(2),
    clicked: false,
    name: "ابن تيمية",
    img: taimya,
    description: `تبوأ شيخ الإسلام ابن تيمية مكانة عظيمة بين علماء عصره،  فهو إن درّس أو خطب أو أفتى أو كتب رسالة أو كتاباً في أي فن من الفنون أتى بما يفوق علماء عصره، وما يبهر عقولهم.
        اضافة الى بُعده عن المناصب أو أخذ رواتب من الدولة، وكان ذلك عن عزم وتصميم، فلم يتول القضاء أو الإمارة أو غيرها، حتى وهو في السجن لم يأكل من الطعام الذي يُحضر له في السجن. كما أنه جمع مع العلم الراسخ و الامامة في الدين الجهاد في سبيل الله، وأمره بالمعروف ونهيه عن المنكر.
        والمطلع على هذا الجانب من حياة الشيخ يكاد يجزم بأنه لم يبق له من وقته فُضلة، وقد حورب وأوذي وسجن مرات في سبيل الله، حتى وافته منيته مسجوناً.
        لما دخلَ شيخ الإسلام ابن تيمية السجن، وجد المحابيس مشتغلين بأنواع من اللعب مع تضييع الصلوات، فأنكر الشيخ عليهم، وأمرهم بملازمة الصلاة، وعلمهم السنّة، حتى صار الحبس خيرًا من المدارس، وصار خلقٌ من المحابيس إذا أُطلقوا يختارون الإقامة، وصار السجن يمتلئ منهم.
        كان إبن تيمية مسجونا وكان يؤلف كتب فصادروا منه المحبرة والأوراق فجعل يؤلف على جدران الحائط فعندما جاء اليوم الذي توفي فيه قام من الصباح تطهر وتوضأ فأخذ يقرأ القرآن حتى بلغ قوله : إن المتقين في جنات ونهر في مقعد صدق عند مليك مقتدر 
        `,
  },
  {
    id: Math.random().toString(36).substring(2),
    clicked: false,
    name: "الحسن بن قحطبة",
    img: qohtoba,
    description: `كان النصـ.ارى يسمون القائد العباسي الحسن بن قحطبة بــ”التنين” وذلك لكثرة غـزواته وغـاراته في بلاد الروم .. وكان الحسن والي امير المؤمنين الخليفة أبي جعفر المنصور على أرمينية.

        "الحَسَن بن قَحْطَبَة الطائي" أحد القادة الشجعان المقدمين في بداية عصر "الخلافة العباسية".
        استخلفه الخليفة "أبوجعفر المنصور" على أرمينية، ثم استقدمه، لمساعدة الداهية "أبي مسلم الخراساني"، على قمع بعض الثورات.
        كما سار رحمه الله بأمر من "المنصور" في سبعين ألفاً، إلى "ملطية" فكان له فيها أثر عظيم. وغزا الصائفة، في ثمانين ألفاً، فأوغل في بلاد الروم،
        تم تعيينه في بعض الأحيان في الحدود مع الإمبراطورية البيزنطية، حيث قاد غارات الصيف إلى آسيا الصغرى في حصار كماخ`,
  },
  {
    id: Math.random().toString(36).substring(2),
    clicked: false,
    name: "الظاهر بيبرس",
    img: bibarss,
    description: `السلطان المملوكي ركن الدين بيبرس, قام سيف الدين قطز  باستدعاء بيبرس من الشام لمعاونته في إيقاف زحف التتار على الشرق، فتمكنا معاً من سحق التتار في معركة "عين جالوت"، و تولى بيبرس حكم مصر عقب مقتل قطز.
        لم يقتصر دور بيبرس على التصدي لتهديد التتار للدولة الإسلامية وحسب، فقد عمل على تصفية الوجود الصليبي في الشام، وكان له الفضل في تطهير مدن قيسارية وأرسوف وطبرية ويافا وأنطاكية من الصليبيين.
        لم يكن بيبرس محارباً بارعاً فحسب، بل كان رجل دين ودولة، وكان يكره الفساد فأمر بالقضاء على تجارة الخمور وعلى مروجي الرذيلة، ودعاهم إلى التوبة والرجوع إلى الطريق المستقيم، وأعاد للجامع الأزهر مكانته`,
  },
  {
    id: Math.random().toString(36).substring(2),
    clicked: false,
    name: "القعقاع بن عمرو التميمي",
    img: qaaqaa,
    description: `القعقاع بن عمرو التميمي، الذي كان يقول عنه أبو بكر رضي الله عنه: صوته في الجيش خير من ألف رجل، وكان لا يُهزم جيش يحارب فيه القعقاع، غنم في فتح المدائن أدرع كسرى وسيفه، وكان يتقلده في أوقات الزينة، وكانت كتيبته التي يقودها تُسمى الخرساء، أرسله سيدنا عمر إلى سعد عندما طلب المدد، وقال لا يهزم جيش فيه مثل هذا، وكتب سعد عنه لعمر فقال: لم أر مثل القعقاع حمل يوماً ثلاثين غارة، يقتل في كل غارة فارساً من فرسان الفُرس المشهورين،سكن الكوفة وفيها توفي`,
  },
  {
    id: Math.random().toString(36).substring(2),
    clicked: false,
    name: "الكامل محمد الأيوبي",
    img: elKamil,
    description: `بعدما سقطت بغداد بأربعة أشهر اتجهت جيوش الثتار نحو الأناضول و شمال الشام حيث الكامل محمد الأيوبي الذي أبى إلّا المقاومة والجهاد. فجمع جيشه وتحصن بمدينة ميافارقين الحصينة فأرسل هولاكو جيشا كبيرا بقيادة ابنه أشموط. فحاصروا المدينة سنة ونصفا ولكن انهارت بعد مقاومة عنيفة لا تكاد تجد لها مثيلا أمام جحافل التتار المجرمين، ثم قام بتعذيب الكامل محمد الأيوبي تعذيبا أليما حتى فاضت روحه إلى بارئها تقبله الله.
        أراد هلاكو بهذا التنكيل البشع بأهل ميافارقين وأميرها أن يرسل رسالة للعالم الإسلامي أنذاك أنه لا جدوى من المقاومة، سنقتلكم تقتيلا في نهاية المطاف... فقط تستطيعون باستسلامكم أن تقللوا خسائركم.
         إلا أن هناك من فهم الرسالة بطريقة مختلفة هناك من رأى في الكامل رحمه الله بطلا صنديدا وشجاعا عميدا وقدوة في الصبر والنضال والجهاد فرفضوا الاستسلام وباعوا أنفسهم لله فأعدوا العدة والعتاد وجمعوا الجيوش ونادوا حي على الجهاد فكانت نصر من عند الله في عين جالوت على يد دولة المماليك بعد ذلك نتيجة حتمية وسنة كونية للنصر ولو بعد حين`,
  },
  {
    id: Math.random().toString(36).substring(2),
    clicked: false,
    name: "المعتصم بالله",
    img: moatassim,
    description: `أغار الإمبراطور تيوفيل البيزنطي على مدينة زبطرة وهي أقرب الثغور الإسلامية إلى أراضي الدولة البيزنطية، فأحرقها وخربها وقتل رجالها وسبى نسائها وأطفالها، وقد غضب المعتصم لهذا الحدث،  أن امرأة هاشمية أخذت تصيح عندما وقعت في أسر الروم (وا معتصماه)، فلما بلغ ذلك المعتصم أقسم بأن ينتقم من الروم.
        جمع المعتصم جيشًا كبيرًا بلغ تعداده خمسمائة ألف جندي  تولى قيادته بنفسهِ.  ثم توجه بعدها إلى مدينة عمورية وضرب حصارًا عليها، وبعد الحصار الشديد تمكن المعتصم من اقتحام عمورية عنوة وتخريبها وأسر من فيها. 
        *
        هيهات زُعزعت الأرضُ الوقور بهِ .. .. عن غزو محتسبٍ لا غزو مكتسبِ
        *
        إن الأسودَ أسودَ الغيل همتها .. .. يومَ الكريهةِ في المسلوبِ لا السَلَبِ`,
  },
  {
    id: Math.random().toString(36).substring(2),
    clicked: false,
    name: "خير الدين بربروس",
    img: barbarouss,
    description: `لا بد أنها كانت من أسوأ ليالي الزمان. تلك التي خرجت فيها ألاف الأسر المسلمة من بيوتهم خوفا من بطش الجنود الإسبان أوائل القرن السادس عشر الميلادي وبعد سقوط غرناطة آخر مدن الأندلس لم يكن هناك مفر إما التنصّر وإما القتل بأبشع الطرق التي عرفها التاريخ الإنساني عبر محاكم التفتيش الإسبانية.
        لم يكن هناك مهرب إلى الشمال فهناك الأعداء أيضا كان الهروب فقط إلى السواحل الجنوبية حيث البحر يفصل بينهم وبين بلاد المغرب المسلمة ومن وسط الظلام الحالك تأتي النجدة عبر سفن يقودها أسد البحار وسيد القباطنة الأتراك البحار المجاهد خير الدين بربروس، ليحمل على سفنه آلاف المسلمين ويعبر بهم نحو المغرب او الجزائر. كان الإسبان يخشونه بشدة و لم يتعرض لسفنه أحد بينما استمرت رحلاته بين شواطئ الأندلس والمغرب العربي نحو ستة أعوام كاملة نجّى الله بها على يديه عشرات الآلاف من الأنفس وبلغت شهرته الآفاق ثم أصبح فيما بعد قائدا للأسطول العثماني. فسبحان الذي جعل مع العسر يسرى`,
  },
  {
    id: Math.random().toString(36).substring(2),
    clicked: false,
    name: "سعيد بن جبير",
    img: jubair,
    description: `كان سعيد بن جبير من اعلم التابعين. قال خصيف: " كان اعلمهم بالطلاق سعيد بن المسيب. وبالتفسير مجاهد. وبالحج عطاء. وبالحلال والحرام طاووس. واجمعهم لذلك كله. سعيد بن جبير". زكّاه ابن عباس، فكان اذا اتاه اهل الكوفة يستفتونه يقول : "أليس فيكم ابن ام الدهماء؟ -يعني سعيد ابن جبير-". وقال له ابن عباس  : "حدث. قال احدث وانت هنا. قال اوليس من نعمة الله عليك ان تحدث وانا شاهد. فان اصبت فذاك. وان اخطأت علمتك." وكان عالما بالمواريث والحساب.  كان سعيد ابن جبير لا يدع احدا يغتاب عنده. 
        قتله الحجاج في شعبان. سنة خمس وتسعين في مدينة واسط. وهو ابن تسع واربعين سنة على الاصح. قال ميمون ابن مهران : "لقد مات سعيد بن جبير، وما على وجه الارض احد إلا وهو محتاج الى علمه`,
  },
  {
    id: Math.random().toString(36).substring(2),
    clicked: false,
    name: "صلاح الدين الايوبي",
    img: salahudin,
    description: `هو السلطان الكبير الملك الناصر صلاح الدين أبو المظفر يوسف بن الأمير نجم الدين أيوب.
        أكمل مشوار نور الدين زنكي، فأعاد مصر إلى حضيرة السنة و أقامها، و لكن لم يغب عن ناظره قط المسجد المبارك : بيت المقدس.
        
        قاد عدّة حملات ومعارك ضد الفرنجة وغيرهم من الصليبيين،وقد تمكن في نهاية المطاف من استعادة معظم أراضي فلسطين ولبنان بما فيها مدينة القدس، بعد أن هزم جيش بيت المقدس هزيمة منكرة في معركة حطين.
        وقد نذر صلاح الدين أن يقتل أرناط صاحب الموصل لأنه مر به قوم في مصر في حال الهدنة فغدر بهم فناشدوه الصلح فقال ما فيه استخفاف بالنبي صلى الله عليه وسلم وقتلهم..
        فلما أسره صلاح الدين قال له: أنا أنتصر لمحمد صلى الله عليه وسلم منك, ثم عرض عليه الإسلام فأبى فقتله, وطار صيته في الدنيا وهابته الملوك`,
  },
  {
    id: Math.random().toString(36).substring(2),
    clicked: false,
    name: "طارق بن زياد",
    img: tariq,
    description: `بعد نجاح العمليَّات العسكريَّة لطارق بن زياد، تمَّ لموسى بن نصير السيطرة على كامل المغرب الأقصى، وامتد النفوذ الأموي الإسلامي إلى تلك المناطق وأصبحت من حينها جزءًا من العالم الإسلامي.
        أرسل موسى بن نصير طارق بن زياد على رأس جيشٍ عظيم وصل تعداد أفراده إلى نحو 7,000 رجل معظمهم من البربر. عبر طارق بن زياد وجيشه المضيق الفاصل بين البحر المتوسط والمحيط الأطلسي، ونزل في رأس شبه الجزيرة الأيبريَّة في الموضع الذي يعرف اليوم بجبل طارق وكان النصر الساحق بقيادته في معركة "وادي لكه" التي أنهت حكم القوط للأندلس.
        ‏رغم أن مساحة غرناطة لا تتجاوز ثمن مساحة الأندلس الإسلامية، إلا أن اجتياح الصليبيين لها قد استغرق قرنين ونصف، وتعاقب عليه اربعة ممالك أسبانية حتى انتزعوها من المسلمين
بينما لم يستغرق فتح طارق بن زياد لها سوى أسبوعين

        `,
  },
  {
    id: Math.random().toString(36).substring(2),
    clicked: false,
    name: "محمد الفاتح",
    img: elFatih,
    description: `شاءت الأقدار أن يكون السلطان العثماني محمد الفاتح هو صاحب بشارة القسطنطينية التي بشّر بها النبي – صلى الله عليه وسلم – في حديثه: “لتَفْتَحُنّ القسطنطينية ، فلنعم الأمير أميرها، ولنعم الجيش ذلك الجيش".  وانتظر المسلمون ثمانية قرون ونصف قرن حتى تحققت البشارة، وفُتحت القسطنطينية.
        انتشرت السفن العثمانية في المياه المحيطة بالمدينة، إلا أنها لم تستطع الوصول إلى "القرن الذهبي" بسبب وجود السلسلة الضخمة التي منعت أي سفينة من دخوله, ولما استمر الحصار من دون جدوى فكر السلطان في جرّ السفن من المضيق عبر البر، بحيث تُسحب على أخشاب مدهونة بالزيت مسافة 3 أميال ثم يتمّ إنزالها في القرن الذهبي، وقد تمكنوا من سحب أكثر من 70 سفينة وإنزالها على حين غفلة من العدو، وكانت أجزاء من السور في تلك الجهة مهدمة وغير منيعة يسهل اختراقها.
         وسميت المدينة بعد ذلك "إسلامبول" أي مدينة الإسلام.
        `,
  },
  {
    id: Math.random().toString(36).substring(2),
    clicked: false,
    name: "محمد بن القاسم الثقفي",
    img: thaqafi,
    description: `وصلت الأخبار أن النساء المسلمات مسجونات في سجن «الديبل» ويأبى ملك السند الإفراج عنهن عنادًا للعرب. فأُختير محمد بن االقاسم الثقفي ليكوني ليكون قائد جيش المسلمين وكان عمره 17 سنة، فاتجه نحو بلاد السند وفتحها مدينة بعد أخرى في مدة سنتين إلى أن التقى جيش المسلمين بقيادته الشابة مع الجيش السندي بقيادة الملك داهر في معركة دامية مصيرية سنة 92هـ، فانتصر المسلمون وقتل ملك السند في الميدان. ليكون بذلك مؤسسًا لأول دولة إسلامية في الهند.
        لقد أثبت محمد بن االقاسم أن تحمل المسؤولية أثناء الشباب ليس من باب تكليف ما لا يطاق ولا هو خلل تربوي بل هو الأسلوب الصحيح في بناء الرجال.
        
        إن المــروءة والسماحـــة والنـدى .. .. لمحمد بن االقاسـم بن محمد
        *
        ساس الجيوش لسبع عشرة حجّة .. .. يا قرب ذلك سؤددًا من مولد`,
  },
  {
    id: Math.random().toString(36).substring(2),
    clicked: false,
    name: "محمود بن سبكتكين الغزنوي",
    img: sabaktakin,
    description: `
        الملك يمين الدولة، فاتح الهند، أبو القاسم، محمود بن سيد الأمراء ناصر الدولة سبكتكين، التركي، صاحب خراسان والهند وغير ذلك.
        حرص والده على أن يعلمه منذ طفولته القراءة والكتابة، كما حرص على تحفيظه القرآن الكريم وتعليمه الفروسية والقتال، لكي ينشأ نشأة فارس ملم بفنون القتال، وقادر على القيام بمهام السياسة.
        وقد نتج عن فتوحاته في الهند دخول الكثير من السكان الهنود و أمرائهم وملوكهم إلى الإسلام، وانتشرت بينهم اللغة العربية لتسهيل قراءة القرآن الكريم وتعلم فقه الدين واللغة`,
  },

  {
    id: Math.random().toString(36).substring(2),
    clicked: false,
    name: "نظام الملك الطوسي",
    img: toussi,
    description: `نظام الملك الطوسي ، عاقل ، سائس ، خبير ، سعيد ، متدين ، محتشم ، عامر المجلس بالقراء والفقهاء . أنشأ المدرسة الكبرى ببغداد وأخرى بنيسابور ، وأخرى بطوس ورغب في العلم ، وأدر على الطلبة الصلات . وأملى الحديث ، وبعد صيته . 
        ظهرت قوة الوزير نظام الملك واتساع نفوذه بعد وفاة ألب أرسلان، فوقف إلى جوار ابنه الأكبر ملكشاه، بهر العقول سيرة النظام جودا وكرما وعدلا ، وإحياء لمعالم الدين ،  لم يكن وزيرًا لامعًا وسياسيًّا ماهرًا فحسب؛ بل كان داعيًا للعلم والأدب محبًّا لهما؛ أنشأ المدارس المعروفة باسمه «المدارس النظامية»، وأجرى لها الرواتب، وجذب إليها كبار الفقهاء والمحدِّثين، وفي مقدِّمتهم حُجَّة الإسلام أبو حامد الغزالي. ثم ختم له بالقتل وهو مار إلى الحج في رمضان ، فمات ملكا في الدنيا ، ملكا في الآخرة ، رحمه الله `,
  },
  {
    id: Math.random().toString(36).substring(2),
    clicked: false,
    name: "نور الدين زنكي",
    img: nourDinZin,
    description: `نشأ في كفالة والده وتعلم القرآن والفروسية. كان شهمًا وشجاعًا، يُعتبر من أعظم القادة في زمانه. كرس حياته لخدمة الرعية وتأسيس دولة قوية.
        لم يلقى ربه قبل أن يرسل جيشه بقيادة صلاح الدين ليحرر مصر من الحكم الفاطمي الجائر ويعيدها إلى حاضنة السنة بعد مئتي سنة من الحكم الشيعي ليتهيأ العالم الإسلامي بعدها لفتح القدس وتحرير بقية الاراضي المحتلة.
         هذا هو الملك العادل نور الدين محمود زنكي، وقف عن التبسم في دمشق لأن دمياط في مصر محاصرة ولم يهدأ له بال حتى تأكد من صدق رؤية النبي صلى الله عليه وسلم وجلاء الصليبيين عن دمياط وكان لنور الدين رحمه الله فضل عظيم فيما بعد في تحرير بيت المقدس أما الآن فها هي غزة محاطة من جميع الجهات تقريبا ببلاد المسلمين ومع ذلك ترى العدو يحاصرها ويدك مبانيها ويقتل أهلها تقتيلا ويمنع عنهم الماء والطعام والدواء والكهرباء، فهل من محمود ثان؟`,
  },
  {
    id: Math.random().toString(36).substring(2),
    clicked: false,
    name: "يوسف بن تاشفين",
    img: tachfin,
    description: `أمير المسلمين ، السلطان أبو يعقوب يوسف بن تاشفين اللمتوني البربري الملثم ، ويعرف أيضا بأمير المرابطين ، وهو الذي بنى مراكش ، وصيرها دار ملكه .
        في الوقت الذي كان فيه ابن تاشفين يواصل فتوحاته ببلاد المغرب، ويعمل على استتباب الأمن والاستقرار بالدولة المرابطية، كان المسلمون في بلاد الأندلس يعيشون الويلات بسبب القمع والاضطهاد من قبل ملوك الإفرنجة الصليبيين. 
        قاموا بالاستنجاد بيوسف بن تاشفين أمير الدولة المرابطية، ليدافع عنهم ويقيهم شر ألفونسو السادس وحلفائه. واستجاب ابن تاشفين -الذي تجاوز عمره حينها 70 عاما-,  وانتهت بعد عدة أيام بهزيمة ساحقة للجيوش القشتالية، وتمكن بذلك المسلمون من استرجاع مدينة بلنسية وبسط سيادتهم من جديد على الجزيرة الخضراء، التي كانت قد سُلبت منهم قبل ذلك`,
  },
];

export default heros;
